[
 {
   "name": "Salmonberry",
   "slug": "salmonberry",
   "latin": "Rubus spectabilis",
   "wikilink": "https://en.wikipedia.org/wiki/Rubus_spectabilis",
   "Clade": "Rosids",
   "Order": "Rosales",
   "Family": "Rosacaea",
   "range": "Native to the west coast of North America from west central Alaska to California, inland as far as Idaho. Salmonberries are found in moist forests and stream margins, especially in the coastal forests. In open areas they often form large thickets, and thrive in the open spaces under stands of red alder (Alnus rubra).\n",
   "identification": "Rubus spectabilis is a shrub growing to 1–4 m (40-160 inches or 1.3-13.3 feet) tall, with perennial, not biennial woody stems that are covered with fine prickles. The leaves are trifoliate (with three leaflets), 7–22 cm (2.8-8.8 inches) long, the terminal leaflet larger than the two side leaflets. The leaf margins are toothed. The flowers are 2–3 cm (0.8-1.2 inches) in diameter, with five pinkish-purple petals; they are produced from early spring to early summer. The berries ripen from early May to late July in most of the Pacific Northwest (later in cooler climates), and resembles a large shiny yellow to orange-red blackberry 1.5–2 cm (0.6-0.8 inches) long with many drupelets.",
   "berry": "Salmonberries are edible and share the fruit structure of the raspberry, with the fruit pulling away from its receptacle. The fruit has been referred to as \"insipid\",[7] but depending on ripeness and site, they are good eaten raw and when processed into jam, candy, jelly and wine. They were an important food for indigenous peoples. Traditionally, the berries were eaten with salmon or mixed with oolichan grease or salmon roe. They were not dried because of their high moisture content.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/1/14/Rubus_spectabilis_1564.JPG",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/9/93/Salmonberry_Blossom.jpg",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/0/04/Rubus_spectabilis_%27Olympic_Double%27_Leaves.JPG",
   "image3": ""
 },
 {
   "name": "Red Huckleberry",
   "slug": "red-huckleberry",
   "latin": "Vaccinium parvifolium",
   "wikilink": "https://en.wikipedia.org/wiki/Vaccinium_parvifolium",
   "Clade": "Asterids",
   "Order": "Ericales",
   "Family": "Ericacaea",
   "range": "Native to western North America, where it is common in forests from southeastern Alaska and British Columbia south through western Washington and Oregon to central California.",
   "identification": "It is a deciduous shrub growing to 4-metre (13 ft) tall with bright green shoots with an angular cross-section. The leaves are ovate to oblong-elliptic, 9-millimetre (0.35 in) to 30-millimetre (1.2 in) long, and 4-millimetre (0.16 in) to 16-millimetre (0.63 in) wide, with an entire margin.\nThe flowers are yellow-white to pinkish-white with pink, decumbent bell-shaped 4-millimetre (0.16 in) to 5-millimetre (0.20 in) long",
   "berry": "The fruit is an edible red to orange berry 6-millimetre (0.24 in) to 10-millimetre (0.39 in) in diameter. Raw or cooked and used in making jams, pies, jellies etc. The fruit can also be dried for later use. An acid flavour, but it is very palatable. The fruit makes a very superior jelly. The fruit is about 12mm in diameter. A tea is made from the dried fruit and leaves.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Vaccinium_parvifolium_0325.JPG",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/3/35/Vaccinium_parvifolium_04041.JPG",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Mount_Seymour_Provincial_Park%2C_BC_%28DSCF8610%29.jpg",
   "image3": ""
 },
 {
   "name": "Red Elderberry",
   "slug": "red-elderberry",
   "latin": "Sambucus racemosa",
   "wikilink": "https://en.wikipedia.org/wiki/Sambucus_racemosa",
   "Clade": "Asterids",
   "Order": "Dipsacales",
   "Family": "Adoxaceae",
   "range": "It is native to Europe, northern temperate Asia, and North America across Canada and the United States. It grows in riparian environments, woodlands, and other habitats, generally in moist areas.",
   "identification": "Sambucus racemosa is often a treelike shrub growing 2–6 m (7–20 ft) tall. The stems are soft with a pithy center.\n\nEach individual leaf is composed of 5 to 7 leaflike leaflets, each of which is up to 16 cm (6 1⁄4 in) long, lance-shaped to narrowly oval, and irregularly serrated along the edges. The leaflets have a strong disagreeable odor when crushed.\n\nThe inflorescence is a vaguely cone-shaped panicle of several cymes of flowers blooming from the ends of stem branches. The flower buds are pink when closed, and the open flowers are white, cream, or yellowish. Each flower has small, recurved petals and a star-shaped axis of five white stamens tipped in yellow anthers. The flowers are fragrant and visited by hummingbirds and butterflies.",
   "berry": "The fruit is a bright red or sometimes purple drupe containing 3 to 5 seeds. It has been used as a traditional medicinal plant by Native Americans, including the Bella Coola, Carrier, Gitksan, Hesquiaht, Menominee, Northern Paiute, Ojibwa, Paiute, Potawatomi, Tlingit, and Haida peoples. The uses included as an emetic, antidiarrheal, cold and cough remedy, dermatological and gynecological aid, and a hemostat. The fruits are reportedly safe to eat when cooked, but are potentially poisonous when raw. They were cooked in a variety of recipes by Native Americans, including by the Apache, Bella Coola, Gitxsan, Gosiute, Makah, Ojibwa, Quileute, Skokomish, Yurok peoples.\n\nThe fruits are popular with birds, who also distribute the seeds. The flowers attract butterflies and hummingbirds.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/1/14/Sambucus_racemosa_1567.JPG",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/9/94/Sambucus_racemosa_6269.JPG",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/c/c4/0_Sambucus_racemosa_-_Vallorcine.JPG",
   "image3": ""
 },
 {
   "name": "Thimbleberry",
   "slug": "thimbleberry",
   "latin": "Rubus parviflorus",
   "wikilink": "https://en.wikipedia.org/wiki/Rubus_parviflorus",
   "Clade": "Rosids",
   "Order": "Rosales",
   "Family": "Rosacaea",
   "range": "Native to western North America from Alaska south as far as California, New Mexico, Chihuahua, and San Luis Potosí. Its range extends east to the Rocky Mountains and discontinuously to the Great Lakes Region. It grows from sea level in the north, up to elevations of 3,000 m (10,000 ft) in the south.",
   "identification": "Rubus parviflorus is a dense shrub up to 2.5 meters (8.2 ft) tall with canes no more than 1.5 centimeters (0.59 in) in diameter, often growing in large clumps which spread through the plant's underground rhizome. Unlike many other members of the genus, it has no prickles. The leaves are palmate, up to 20 centimeters (7.9 in) across (much larger than most other Rubus species), with five lobes; they are soft and fuzzy in texture.\n\nThe flowers are 2 to 6 centimeters (0.79 to 2.36 in) in diameter, with five white petals and numerous pale yellow stamens. The flower of this species is among the largest of any Rubus species, making its Latin species name parviflorus (\"small-flowered\") a misnomer.",
   "berry": "The plant produces edible composite fruit approximately a centimeter (0.4 inches) in diameter, which ripen to a bright red in mid to late summer. Like other raspberries it is not a true berry, but instead an aggregate fruit of numerous drupelets around a central core. The drupelets may be carefully removed separately from the core when picked, leaving a hollow fruit which bears a resemblance to a thimble, perhaps giving the plant its name.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Rubus_parviflorus_9481.JPG",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Thimbleberry_flower_%28Rubus_parviflorus%29.jpg",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Thimbleberry_Textures_%283629325115%29.jpg",
   "image3": "https://en.wikipedia.org/wiki/Rubus_parviflorus#/media/File:Thimbleberry_(6000475585).jpg"
 },
 {
   "name": "Blackcap Raspberry",
   "slug": "blackcap-raspberry",
   "latin": "Rubus occidentalis",
   "wikilink": "https://en.wikipedia.org/wiki/Rubus_occidentalis",
   "Clade": "Rosids",
   "Order": "Rosales",
   "Family": "Rosacaea",
   "range": "The plant is native to western North America, found in British Columbia (Canada); California, Idaho, Montana, Oregon, and Washington (Western U.S.); and Baja California state (Mexico).[4][5]",
   "identification": "Rubus occidentalis is a deciduous shrub growing to 2–3 m (7–10 feet) tall, with prickly shoots. The leaves are pinnate, with five leaflets on leaves, strong-growing stems in their first year, and three leaflets on leaves on flowering branchlets. The flowers are distinct in having long, slender sepals 6–8 mm long, more than twice as long as the petals. ",
   "berry": "The round-shaped fruit is a 12–15 mm diameter aggregation of drupelets; it is edible, and has a high content of anthocyanins and ellagic acid.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/4/46/Rubus_occidentalis_2008_07_06.JPG",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Pomological_Watercolor_POM00007255.jpg",
   "wideimg1": "",
   "image3": ""
 },
 {
   "name": "Trailing Blackberry",
   "slug": "trailing-blackberry",
   "latin": "Rubus ursinus",
   "wikilink": "https://en.wikipedia.org/wiki/Rubus_ursinus",
   "Clade": "Rosids",
   "Order": "Rosales",
   "Family": "Rosacaea",
   "range": "The plant is native to western North America, found in British Columbia (Canada); California, Idaho, Montana, Oregon, and Washington (Western U.S.); and Baja California state (Mexico).",
   "identification": "Rubus ursinus is a wide, mounding shrub or vine, growing to 2–5 feet (0.61–1.52 m) high, and more than 6 feet (1.8 m) wide. The prickly branches can take root if they touch soil, thus enabling the plant to spread vegetatively and form larger clonal colonies.\n\nLeaves usually have 3 leaflets but sometimes 5 or only 1, and are deciduous. The plant is dioeocious, with male and female plants on separate plants, also unusual for the genus. As with other Rubus, the canes are typically vegetative the first year, and reproductive in the second.\n\nFlowers are white with narrower petals than most related species, and have a fragrance.The sweet, very aromatic, edible fruits are dark purple, dark red, or black and up to 2 centimeters (0.8 inches) in length.",
   "berry": " The sweet, very aromatic, edible fruits are dark purple, dark red, or black and up to 2 centimeters (0.8 inches) in length.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/7/7a/6b_Trailing_blackberries_%287518582588%29.jpg",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Rubus_ursinus_flower.jpg",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/3/38/Rubus_ursinus_10689.JPG",
   "image3": ""
 },
 {
   "name": "Himalayan Blackberry",
   "slug": "himalayan-blackberry",
   "latin": "Rubus armeniacus",
   "wikilink": "https://en.wikipedia.org/wiki/Rubus_armeniacus",
   "Clade": "Rosids",
   "Order": "Rosales",
   "Family": "Rosacaea",
   "range": "The plant is native to Armenia and Northern Iran, and widely naturalised elsewhere.",
   "identification": "Rubus armeniacus is a perennial plant that bears biennial stems (\"canes\") from the perennial root system. In its first year a new stem grows vigorously to its full length of 4–10 m, trailing along the ground or arching up to 4 m high. The stem is stout, up to 2–3 cm diameter at the base, and green. The canes can turn more red/purple if they are exposed to bright sunlight. This is common in the summer. The leaves on first year shoots are 7–20 cm long, palmately compound with either three or more commonly five leaflets. The leaflets are moderately serrated. Flowers are not produced on first year shoots. In its second year, the stem does not grow longer, but produces several side shoots, which bear smaller leaves with three leaflets (rarely a single leaflet). These leaflets are oval-acute, dark green above and pale to whitish below, with a toothed margin, and thorns along the midrib on the underside. The flowers are produced in late spring and early summer on panicles of 3–20 together on the tips of the second-year side shoots, each flower 2–2.5 cm diameter with five white or pale pink petals. The flowers are bisexual (perfect) containing both male and female reproductive structures.",
   "berry": "The fruit in botanical terminology is not a berry, but an aggregate fruit of numerous drupelets, 1.2–2 cm diameter, ripening black or dark purple. Both first and second year shoots are spiny, with short, stout, curved, sharp spines. Mature plants form a tangle of dense arching stems, the branches rooting from the node tip when they reach the ground.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/8/88/Rubus_bifrons_-_Botanischer_Garten%2C_Frankfurt_am_Main_-_DSC02472.JPG",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Himalayan_Blackberry_%26_Spider.jpg",
   "wideimg1": "",
   "image3": "https://upload.wikimedia.org/wikipedia/commons/c/c9/European_honey_bee.jpg"
 },
 {
   "name": "Salal",
   "slug": "salal",
   "latin": "Gaultheria shallon",
   "wikilink": "https://en.wikipedia.org/wiki/Gaultheria_shallon",
   "Clade": "Asterids",
   "Order": "Ericales",
   "Family": "Ericacaea",
   "range": "Gaultheria shallon is a leathery-leaved understory shrub, native to western North America from British Columbia to California.",
   "identification": "Gaultheria shallon is 0.2 to 5 m (0.66 to 16.40 ft) tall, sprawling to erect. Evergreen, its dense, tough, egg-shaped leaves are shiny and dark green on the upper surface, and rough and lighter green on the lower. Each finely and sharply serrate leaf is 5 to 10 cm (2.0 to 3.9 in) long. The inflorescence consists of a bracteate raceme, one-sided, with five to 15 flowers at the ends of branches. Each flower is composed of a deeply five-parted, glandular-haired calyx and an urn-shaped pink to white, glandular to hairy, five-lobed corolla, 7 to 10 mm (0.28 to 0.39 in) long. ",
   "berry": "The reddish to blue, rough-surfaced, hairy, nearly spherical fruit is 6 to 10 mm (0.24 to 0.39 in) in diameter. Its dark blue berries and young leaves are both edible and are efficient appetite suppressants, both with a unique flavor. G. shallon berries were a significant food resource for native people, who ate them fresh and dried them into cakes. They were also used as a sweetener, and the Haida used them to thicken salmon eggs. The leaves of the plant were also sometimes used to flavor fish soup. More recently, G. shallon berries are used locally in jams, preserves, and pies. They are often combined with Oregon-grape because the tartness of the latter is partially masked by the mild sweetness of G. shallon.\n",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Salal_berries.jpg",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Gaultheria_shallon_6206.JPG",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Gaultheria_shallon_31974.JPG",
   "image3": ""
 },
 {
   "name": "Oregon Grape",
   "slug": "oregon-grape",
   "latin": "Mahonia aquifolium",
   "wikilink": "https://en.wikipedia.org/wiki/Mahonia_aquifolium",
   "Clade": "Eudicots",
   "Order": "Ranunculales",
   "Family": "Berberidaceae",
   "range": "Mahonia aquifolium is a native plant in the North American West from Southeast Alaska to Northern California, and eastern Alberta to central New Mexico, often occurring in the understory of Douglas fir forests (although other forest types contain the species) and in brushlands in the Cascades, Rockies, and northern Sierras.",
   "identification": "Mahonia aquifolium grows to 1–2 m (3 ft 3 in–6 ft 7 in) tall by 1.5 m (5 ft) wide, with pinnate leaves up to 30 cm (12 in) long, each leaf made up of spiny leaflets. The leathery leaves resemble those of holly and the stems and twigs have a thickened, corky appearance. The flowers, borne in dense clusters in late spring, are yellow, and are followed by spherical dark dusty blue berries, which give rise to the common name \"Oregon grape\".",
   "berry": "The small purplish-black fruits, which are quite tart and contain large seeds, are included in smaller quantities in the traditional diets of Pacific Northwest aboriginal peoples, mixed with salal or another sweeter fruit. Today, they are sometimes used to make jelly, alone or mixed with salal. Oregon-grape juice can be fermented to make wine, similar to European barberry wine folk traditions, although it requires an unusually high amount of sugar. The inner bark of the larger stems and roots of Oregon-grape yields a yellow dye; the berries give purple dye. As the leaves of Oregon-grape are holly-like and resist wilting, the foliage is sometimes used by florists for greenery and a small gathering industry has been established in the Pacific Northwest. Some Indigenous peoples of the Northwest Plateau use Oregon grape for dyspepsia.",
   "berryimg": "",
   "flowerimg": "",
   "wideimg1": "",
   "image3": ""
 },
 {
   "name": "Oval-Leaf Blueberry",
   "slug": "oval-leaf-blueberry",
   "latin": "Vaccinium ovalifolium",
   "wikilink": "https://en.wikipedia.org/wiki/Vaccinium_ovalifolium",
   "Clade": "Asterids",
   "Order": "Ericales",
   "Family": "Ericacaea",
   "range": "The original variety (i.e. the automatically named Vaccinium ovalifolium var[iety] ovalifolium) is found on both the eastern and western sides of the Pacific Ocean; in North America, it is distributed in Canada (in Alberta, British Columbia, Newfoundland, Nova Scotia, southern Ontario, south central Quebec, and southern Yukon Territory); and the United States (in southern Alaska, Idaho, northern Michigan, Oregon, western South Dakota, and Washington); across the Pacific to Asia and Eurasia, it is distributed in Russia (in Kamchatka, the southern Kuril Islands, Primorsky Krai, and Sakhalin); and in Japan (in Hokkaido, and central and northern Honshu).",
   "identification": "Vaccinium ovalifolium is a spreading shrub which may grow to 5 feet (1.5 m) tall. It has pink 1⁄4 in (0.64 cm) urn-shaped flowers. [6][7]",
   "berry": "Berries are dark blue, often black, sometimes with a waxy coating. Vaccinium ovalifolium is used in jams and jellies and for making liqueur. Blueberry herbal tea can be made from the leaves, or from the juice of the blueberries themselves.\n\nVaccinium ovalifolium has been used in Russia in the making of dyes, including the use of its tannin.\n\nIn the winter, Vaccinium ovalifolium is an important food source for grazing deer, goats, and elk, and in the summer the nectar feeds hummingbirds.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Vaccinium_ovalifolium_9618.JPG",
   "flowerimg": "",
   "wideimg1": "",
   "image3": ""
 },
 {
   "name": "Black Huckleberry",
   "slug": "black-huckleberry",
   "latin": "Vaccinium membranaceum",
   "wikilink": "https://en.wikipedia.org/wiki/Vaccinium_membranaceum",
   "Clade": "Asterids",
   "Order": "Ericales",
   "Family": "Ericacaea",
   "range": "Vaccinium membranaceum is native to western North America, with a range extending in the northern from southern Alaska, Yukon, and Northwest Territories south as far as Utah and the northern mountains of California. It can be found from the mountains next to the Pacific Ocean in the west, to the Rocky Mountains and Black Hills in the east.\n\nIsolated populations of this species have been found in Arizona, North Dakota, Minnesota, the Upper Peninsula of Michigan, and Ontario.\n\nVaccinium membranaceum grows at higher elevations in subalpine and alpine environments. It occurs in both pine and spruce dominated forests and in open meadow ecosystems. In forests V. membranaceum often dominates the forest understory during early to mid stages of succession. Vaccinium membranceum is fire adapted. The leaves and stems of the huckleberry are resistant to low-intensity fires, and if burned away they will resprout vigorously from rhizomes buried under the soil.",
   "identification": "Vaccinium membranaceum is an erect shrub growing up to 1.5 metres (4.9 ft) in maximum height. The new twigs are yellow-green and somewhat angled. The deciduous leaves are alternately arranged. The very thin to membranous, oval leaf blades are up to 5 centimeters (2 inches) long. The edges are serrated, with each tiny tooth tipped with a glandular hair. Solitary flowers occur in the leaf axils. Each is around 6 millimeters (1/4 inch) long, urn-shaped to cylindrical, and pale pink to waxy bronze in color.\n\nThey are pollinated by bees.",
   "berry": " Each fruit contains an average of 47 tiny seeds. The fruit is a dark blue-black berry 5–8 mm (0.20–0.31 in) diameter, with a white flesh, edible and sweet when ripe in late summer. Both humans and wildlife enjoy feasting on this fruit in the late summer and early fall. People have been eating the fruit of this species for thousands of years. It was and continues to be widely used for food by Native Americans. The Kutenai called the black huckleberry shawíash (Ktunaxa: ǂawiyaǂ). Alaska Natives consumed it in bread and pies as a source of vitamin C, the Coeur d'Alene people ate the fruit fresh, dried, mashed, cooked, and added it to soup or froze it for later use, and many other groups relished it and stored it frozen, dried, pressed into cakes, or canned for winter use. The plant also provides a key food source for black and grizzly bears, which eat the leaves, stems, roots, and fruit. Elk, moose, and white-tailed deer also browse the plant. The thickets provide cover for many species of small animals.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Huckleberry_1.jpg",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/7/76/Vaccinium_membranaceum_Huckleberry_Flowers.jpg",
   "wideimg1": "",
   "image3": ""
 },
 {
   "name": "Bog Blueberry",
   "slug": "bog-blueberry",
   "latin": "Vaccinium uliginosum",
   "wikilink": "https://en.wikipedia.org/wiki/Vaccinium_uliginosum",
   "Clade": "Asterids",
   "Order": "Ericales",
   "Family": "Ericacaea",
   "range": "Vaccinium uliginosum is native to cool temperate regions of the Northern Hemisphere, at low altitudes in the Arctic, and at high altitudes south to the Pyrenees, the Alps, and the Caucasus in Europe, the mountains of Mongolia, northern China, the Korean Peninsula and central Japan in Asia, and the Sierra Nevada in California and the Rocky Mountains in Utah in North America.\n\nIt grows on wet acidic soils on heathland, moorland, tundra, and in the understory of coniferous forests, from sea level in the Arctic, up to 3,400 metres (11,200 ft) altitude in the south of the range.",
   "identification": "Vaccinium uliginosum is a small deciduous shrub growing to 10–75 cm (4–30 in) tall, rarely 1 m (3.3 ft) tall, with brown stems (unlike the green stems of the closely related bilberry). The leaves are oval, 4–30 mm (0.16–1.18 in) long and 2–15 mm (0.08–0.59 in) wide, blue-green with pale net-like veins, with a smooth margin and rounded apex.\n\nThe flowers are pendulous, urn-shaped, pale pink, 4–6 mm (0.16–0.24 in) long, produced in mid spring. ",
   "berry": "The fruit is a dark blue-black berry 5–8 mm (0.20–0.31 in) diameter, with a white flesh, edible and sweet when ripe in late summer.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Vaccinium_uliginosum_fruit.jpg",
   "flowerimg": "",
   "wideimg1": "",
   "image3": ""
 },
 {
   "name": "Evergreen Huckleberry",
   "slug": "evergreen-huckleberry",
   "latin": "Vaccinium ovatum",
   "wikilink": "https://en.wikipedia.org/wiki/Vaccinium_ovatum",
   "Clade": "Asterids",
   "Order": "Ericales",
   "Family": "Ericacaea",
   "range": "Vaccinium ovatum is a small to medium-sized evergreen shrub native to the Western Pacific Coast of the United States and coastal British Columbia. Typical flora associates are such plants as the western sword fern (Polystichum munitum), coastal woodfern (Dryopteris arguta), California snowberry (Symphoricarpos mollis), common snowberry (Symphoricarpos albus), and thimbleberry (Rubus parviflorus). Often found sprouting from nurse logs and growing in conjunction with red huckleberry (Vaccinium parvifolium).\n",
   "identification": "Vaccinium ovatum is a true huckleberry plant, growing well in shade or sun and thriving in acidic soils. Not needing much sun, the plant has a wide variety of forest homes; it is often seen sprouting out of old coast redwood stumps or dense brambles of other forest growths. The shiny, alternately arranged, egg-shaped leaves are 2 to 3 centimeters (0.8-1.2 inches) long and about a centimeter wide (0.4 inches) with finely serrated edges. During the summer the plant produces round, edible black berries up to a centimeter (0.4 inches) in diameter.\n",
   "berry": "During the summer the plant produces round, edible black berries up to a centimeter (0.4 inches) in diameter. Traditionally huckleberries were sought after and collected by many Native American tribes along the Pacific coast in the region.",
   "berryimg": "https://upload.wikimedia.org/wikipedia/commons/7/77/Vacciniumovatum.jpg",
   "flowerimg": "https://upload.wikimedia.org/wikipedia/commons/2/23/Vaccinium_ovatum_%283438582162%29.jpg",
   "wideimg1": "https://upload.wikimedia.org/wikipedia/commons/0/05/Vaccinium_ovatum_3.jpg",
   "image3": ""
 }
]